
# Качка плаває в прямокутному пруду розміром n на m метрів.
# Це розумна, бойова українська качка.
# Вона знає, що під час тревоги треба якнайшвидше дістатись берега
# і сховатись у кущах.
# Коли залунала сирена вона одразу визначила,
# що до найдовшої сторони пруда їй плисти x метрів,
# а до короткої сторони пруда - y  метрів.
# Визначте її найкоротший шлях до берега.

# Вхідні дані - n, m, x, y

n = 73
m = 63
n, m = sorted([m, n])
x = 56
y = 8
res = min(x, y, n - x, m - y)
print(res)


n = 73
m = 63

x = 56 # to long side, along short
y = 8 # to short side, along long

short_side = min(n, m)
long_side = max(n, m)
shortest = min(x, y, short_side - x, long_side - y)

print(shortest)