# Завдання 1

# По перше додамо додатковий функціонал до класів з попередньої домашньої роботи:

# Додайте поле birthday для дня народження в клас Record . Це поле має бути класу Birthday. 
#
# Це поле не обов'язкове, але може бути тільки одне.
# class Birthday(Field):
#     def __init__(self, value):
#         try:
#             # Додайте перевірку коректності даних
#             # та перетворіть рядок на об'єкт datetime
#         except ValueError:
#             raise ValueError("Invalid date format. Use DD.MM.YYYY")

# class Record:
#     def __init__(self, name):
#         self.name = Name(name)
#         self.phones = []
#         self.birthday = None

# Додайте функціонал роботи з Birthday у клас Record, а саме функцію add_birthday, яка додає день народження до контакту.
# Додайте функціонал перевірки на правильність наведених значень для полів Phone, Birthday.
# Додайте та адаптуйте до класу AddressBook нашу функцію з четвертого домашнього завдання,
# тиждень 3, get_upcoming_birthdays, яка для контактів адресної книги повертає список користувачів, 
# яких потрібно привітати по днях на наступному тижні.


# Тепер ваш бот повинен працювати саме з функціоналом класу AddressBook. 
# Це значить, що замість словника contacts ми використовуємо book = AddressBook()



